Revit 2026 API

# ElementLogicalFilterSetFilters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFilters(
	IList<ElementFilter> filters
)
```
```vb
Public Sub SetFilters (
	filters As IList(Of ElementFilter)
)
```
```cpp
public:
void SetFilters(
	IList<ElementFilter^>^ filters
)
```
```fsharp
member SetFilters :
        filters : IList<ElementFilter> -> unit
```

#### Parameters

filters IListElementFilter

#### Reference

ElementLogicalFilter Class

Autodesk.Revit.DB Namespace